//元组

//数组合并了相同类型的对象， 而元组合并了不同类型的对象

let tom11: [number, string] = [1,'str'];
//数组元素类型必须按照定义时的类型顺序

let tom22: [number, string];
tom22[0] = 1;
tom22[1] = '1123';

tom22 = [1,'1'];

// 越界的元素
// 当添加越界的元素时，它的类型会被限制为元组中每个类型的联合类型
tom22.push('123');

// tom22.push(true); // 报错

// 枚举----------------------------------------------------------------

//枚举使用 enums 关键字定义

enum Days { Sun, Mon, Tue, Wed, Thu, Fri, Sat };
// 枚举成员会被赋值为从0 开始递增的数字，同时也会对枚举值到 枚举名进行反向映射

Days['Sun'] == 0;
Days['Wed'] == 3;


// 手动赋值
// 我们也可以给枚举项手动赋值
enum Days2 {Sun = 7, Mon, Tue = 6, Wed, Thu}